# Introduction to Pandas

In this section of the course we will learn how to use pandas for data analysis. You can think of pandas as an extremely powerful version of Excel, with a lot more features. In this section of the course, you should go through the notebooks in this order:

* Introduction to Pandas
* Series
* DataFrames
* Missing Data
* GroupBy
* Merging,Joining,and Concatenating
* Operations
* Data Input and Output

In [2]:
import pandas as pd
import numpy as np

l = [1.,3.,5.6,6.7,7.]
#se = pd.Series(l)
#pd.Series(l, index = [10, 11, 12, 13, 14])
se = pd.Series(l, index = ["A","B","C","D","E"])

#se["A":"C"]
se[0:2]

# ll = [[2,4,5],[3,5,6],[3,5,6]]

A    1.0
B    3.0
dtype: float64

In [3]:
def sqr_series(list):
    sqrd_series = []
    for i in list:
        yield i*i

In [4]:
mylist = [1,2,3,4]
sqrd = sqr_series(mylist)

In [5]:
string = 'hello'
iter_str = iter(mylist)

In [6]:
mygen = (x*x if x%2 ==0 else x for x in range(0,10))

In [7]:
next(mygen)

0

In [8]:
for i in mygen:
    print(i)

1
4
3
16
5
36
7
64
9

In [9]:
f = {1:"dsnfd", 2:"kjndfds", 3:"kjwhwe"}
pd.Series(f)

1      dsnfd
2    kjndfds
3     kjwhwe
dtype: object

In [10]:
pd.Series([3,6,7,9], index = ['a', 'b', 'c', 'd'])

a    3
b    6
c    7
d    9
dtype: int64

In [11]:
d = {1:"apple", 2:"banana", 3:"orange", 4:"pine-apple"}

In [12]:
s = pd.Series(d)
s

1         apple
2        banana
3        orange
4    pine-apple
dtype: object

In [13]:
ser1 = pd.Series([1,2,3,4],index = ['USA', 'Germany','USSR', 'Japan'])

In [14]:
ser2 = pd.Series([1,2,5,4],index = ['USA', 'Germany','Italy', 'Japan'])

In [15]:
ser1+ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [16]:
l2 = [[1,3,5], [2,5,6], [4,6,8]]
np.array(l2)

#pd.DataFrame(l2,  columns = ["a1", "b1", "c1"])
pd.DataFrame(l2, columns = ["A1", 'B1', 'C1'], index = ['a', 'b', 'c'])

   A1  B1  C1
a   1   3   5
b   2   5   6
c   4   6   8

In [17]:
d2 = {"fruits":["apple","banana","orange","cherry"], "veges":["patato", "tomato", 'chilli', 'capsicum']}
pd.DataFrame(d2, index = [5,6,7,8])

   fruits     veges
5   apple    patato
6  banana    tomato
7  orange    chilli
8  cherry  capsicum

In [18]:
c = pd.DataFrame(d2)

In [19]:
pd.DataFrame(l2, columns = ['a','b','c'])

   a  b  c
0  1  3  5
1  2  5  6
2  4  6  8

In [22]:
from numpy.random import randn
np.random.seed(101)

# df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns=['W', 'X', 'Y', 'Z'])
df = pd.DataFrame(randn(5, 4), index = ['A', 'B', 'C', 'D', 'E'], columns=['W', 'X', 'Y', 'Z'])
df['W'] = df['W']*2+10
df

           W         X         Y         Z
A  15.413700  0.628133  0.907969  0.503826
B  11.302236 -0.319318 -0.848077  0.605965
C   5.963664  0.740122  0.528813 -0.589001
D  10.377391 -0.758872 -0.933237  0.955057
E  10.381589  1.978757  2.605967  0.683509

In [25]:
df['W'][df['W']>0]

A    15.413700
B    11.302236
C     5.963664
D    10.377391
E    10.381589
Name: W, dtype: float64

In [21]:
df["new"] = df['X']*2+10
df

           W         X         Y         Z        new
A  15.413700  0.628133  0.907969  0.503826  11.256265
B  11.302236 -0.319318 -0.848077  0.605965   9.361364
C   5.963664  0.740122  0.528813 -0.589001  11.480244
D  10.377391 -0.758872 -0.933237  0.955057   8.482256
E  10.381589  1.978757  2.605967  0.683509  13.957515

In [22]:
df[df['W']>0]

           W         X         Y         Z        new
A  15.413700  0.628133  0.907969  0.503826  11.256265
B  11.302236 -0.319318 -0.848077  0.605965   9.361364
C   5.963664  0.740122  0.528813 -0.589001  11.480244
D  10.377391 -0.758872 -0.933237  0.955057   8.482256
E  10.381589  1.978757  2.605967  0.683509  13.957515

In [23]:
df

           W         X         Y         Z        new
A  15.413700  0.628133  0.907969  0.503826  11.256265
B  11.302236 -0.319318 -0.848077  0.605965   9.361364
C   5.963664  0.740122  0.528813 -0.589001  11.480244
D  10.377391 -0.758872 -0.933237  0.955057   8.482256
E  10.381589  1.978757  2.605967  0.683509  13.957515

In [24]:
df.loc[['A', 'B']]

           W         X         Y         Z        new
A  15.413700  0.628133  0.907969  0.503826  11.256265
B  11.302236 -0.319318 -0.848077  0.605965   9.361364

In [25]:
df.iloc[1:4]

           W         X         Y         Z        new
B  11.302236 -0.319318 -0.848077  0.605965   9.361364
C   5.963664  0.740122  0.528813 -0.589001  11.480244
D  10.377391 -0.758872 -0.933237  0.955057   8.482256

In [26]:
df.iloc[1:3]

           W         X         Y         Z        new
B  11.302236 -0.319318 -0.848077  0.605965   9.361364
C   5.963664  0.740122  0.528813 -0.589001  11.480244

In [27]:
df.Z

A    0.503826
B    0.605965
C   -0.589001
D    0.955057
E    0.683509
Name: Z, dtype: float64

In [28]:
df[df['Y']>0.85]

           W         X         Y         Z        new
A  15.413700  0.628133  0.907969  0.503826  11.256265
E  10.381589  1.978757  2.605967  0.683509  13.957515

In [29]:
df['N'] = df['Z']*2

In [30]:
df['NN'] = df['Z']*3
df

           W         X         Y         Z        new         N        NN
A  15.413700  0.628133  0.907969  0.503826  11.256265  1.007652  1.511477
B  11.302236 -0.319318 -0.848077  0.605965   9.361364  1.211931  1.817896
C   5.963664  0.740122  0.528813 -0.589001  11.480244 -1.178001 -1.767002
D  10.377391 -0.758872 -0.933237  0.955057   8.482256  1.910113  2.865170
E  10.381589  1.978757  2.605967  0.683509  13.957515  1.367018  2.050527

In [31]:
df.drop("N", axis = 1, inplace  = True)

In [32]:
df

           W         X         Y         Z        new        NN
A  15.413700  0.628133  0.907969  0.503826  11.256265  1.511477
B  11.302236 -0.319318 -0.848077  0.605965   9.361364  1.817896
C   5.963664  0.740122  0.528813 -0.589001  11.480244 -1.767002
D  10.377391 -0.758872 -0.933237  0.955057   8.482256  2.865170
E  10.381589  1.978757  2.605967  0.683509  13.957515  2.050527

In [33]:
# missing data in pandas

d = {'name':["sunny",'dat', 'hat'], "class":["btech", 'mtech', 'mtech']}
d

{'name': ['sunny', 'dat', 'hat'], 'class': ['btech', 'mtech', 'mtech']}

In [34]:
pd.DataFrame(d)

    name  class
0  sunny  btech
1    dat  mtech
2    hat  mtech

In [33]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3],
                  })

In [34]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [31]:
df.dropna(inplace = True)

In [32]:
df

     A    B  C
0  1.0  5.0  1

In [ ]:
index_list = (df.columns.tolist())

In [ ]:
for i in range(0,len(index_list)):
    df[index_list[i]].fillna(value = df[index_list[i]].mean(), inplace=True)

In [ ]:
df

In [35]:
df.fillna(value = "0")

     A    B  C
0  1.0  5.0  1
1  2.0    0  2
2    0    0  3

In [36]:
df["A"].mean()

1.5

In [37]:
df.fillna(value = df['A'].mean())

     A    B  C
0  1.0  5.0  1
1  2.0  1.5  2
2  1.5  1.5  3

In [ ]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3],
                  'D':[4,6,np.nan]})
df

In [ ]:
df.dropna(thresh = 2, axis = 0)

In [38]:
df.isnull().sum()

A    1
B    2
C    0
dtype: int64

In [39]:
# Gruopby

data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [40]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [41]:
dm = df.groupby('Company')
dm.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [42]:
dm.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [43]:
dm.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [44]:
dm.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [45]:
dm.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [46]:
dm.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [47]:
dm.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [ ]:
#. joining , merging and concatnating
import pandas as pd

In [48]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [49]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [50]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [51]:
pd.concat([df1, df2, df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [52]:
pd.concat([df1, df2, df3], axis = 1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [53]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [54]:
right = pd.DataFrame({'key': ['K0', 'K10', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']}) 

right

   key   C   D
0   K0  C0  D0
1  K10  C1  D1
2   K2  C2  D2
3   K3  C3  D3

In [55]:
pd.merge(left,right)

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K2  A2  B2  C2  D2
2  K3  A3  B3  C3  D3

In [56]:
pd.merge(left, right, how = "inner", on = "key")

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K2  A2  B2  C2  D2
2  K3  A3  B3  C3  D3

In [ ]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [ ]:
left

In [ ]:
right

In [ ]:
pd.merge(right, left, on=['key1', 'key2'])

In [ ]:
pd.merge(right, left, how='outer', on=['key1', 'key2'])

In [ ]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [ ]:
left

In [ ]:
right

In [ ]:
right.join(left)

In [ ]:
left.join(right)

In [ ]:
left.join(right, how ='outer')

In [ ]:
left.join(right, how ='outer')

In [57]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [58]:
df.head(5)

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [59]:
df.tail()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [60]:
del(df['col1'])

In [61]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [62]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [63]:
df['col2'].count()

4

In [64]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [65]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [ ]:
df.isnull().sum()

In [ ]:
df[df['col2']==444]

In [ ]:
import pandas as pd

In [ ]:
df = pd.read_csv('/Users/sunil/Desktop/weight-height.csv')
#df.to_csv('/Users/sunil/Desktop/mynewheight.csv')
df

In [ ]:
df

In [ ]:
df.to_csv('/Users/sunil/Desktop/ahhfbc.csv')

In [ ]:
ex = pd.read_excel('/Users/sunil/Desktop/heights_few_samples.xlsx',sheet_name='heights1')

In [ ]:
pd.read_excel()

In [ ]:
from sklearn.datasets import load_iris

In [ ]:
dd = load_iris()

In [ ]:
dd

In [ ]:
df.keys()

In [ ]:
X = pd.DataFrame(dd['data'], columns = ['sepal length (cm)', 'sepal width (cm)','petal length (cm)','petal width (cm)'])
X

In [ ]:
y = pd.DataFrame(dd['target'], columns = ["Species"])
y

In [ ]:
pd.concat([X,y], axis = 1)

In [ ]:
X.isnull().sum()

In [ ]:
X.describe()